GRTsteady4Mesh2/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

time 3000;

dt 5;

application simpleFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime $time;

deltaT 1;

writeControl timeStep;

writeInterval 750;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
functions
{
  residuals
  {
    type residuals;
    functionObjectLibs
      (
        "libutilityFunctionObjects.so"
      );
    enabled yes;
    writeControl timeStep;
    writeInterval 1;
    fields
      (
        p
        U
        k
        omega
        ReThetat
        gammaInt
      );
  }
  forceCoeffs
  {
    type forceCoeffs;
    libs
      (
        "libforces.so"
      );
    patches
      (
        airfoil
      );
    pName p;
    UName U;
    rho rhoInf;
    rhoInf 1.18;
    pRef 0;
    writeControl timeStep;
    writeInterval $dt;
    CofR (0 0 0);
    dragDir (1 0 0);
    liftDir (0 1 0);
    pitchAxis (0 0 1);
    magUInf 1.1516;
    lRef 1.0;
    Aref 0.0009975640502598241;
    binData
    {
      nBin 20;
      direction (1 0 0);
      cumulative yes;
    }
  }
} 	// ************************************************************************* //

