GRTsteady4Mesh2/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																
																
vertices																
(																
	(	0	0	0	)	//	0									
	(	1	0	0	)	//	1									
	(	1	15	0	)	//	2									
	(	-14	0	0	)	//	3									
	(	0	0	0.01	)	//	4									
	(	1	0	0.01	)	//	5									
	(	1	15	0.01	)	//	6									
	(	-14	0	0.01	)	//	7									
	(	21	1.46488594862663	0	)	//	8									
	(	21	15	0	)	//	9									
	(	21	1.46488594862663	0.01	)	//	10									
	(	21	15	0.01	)	//	11									
	(	1	-15	0	)	//	12									
	(	1	-15	0.01	)	//	13									
	(	21	-15	0	)	//	14									
	(	21	-15	0.01	)	//	15									
	(	1	0	0	)	//	16									
	(	1	0	0.01	)	//	17									
																
);																
																
																
blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	298	73	1	)	//block	1
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.932885906040268	2	)												
(	0.6	0.0671140939597316	1.5	)												
	)															
	0.003	0.003														
	(															
(	0.4	0.932885906040268	2	)												
(	0.6	0.0671140939597316	1.5	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.0333333333333333	0.342465753424658	10.8347059433884	)												
(	0.966666666666667	0.657534246575342	18.4591996354128	)												
	)															
	(															
(	0.0333333333333333	0.342465753424658	10.8347059433884	)												
(	0.966666666666667	0.657534246575342	18.4591996354128	)												
	)															
	(															
(	0.0333333333333333	0.342465753424658	10.8347059433884	)												
(	0.966666666666667	0.657534246575342	18.4591996354128	)												
	)															
	(															
(	0.0333333333333333	0.342465753424658	10.8347059433884	)												
(	0.966666666666667	0.657534246575342	18.4591996354128	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	119	73	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	333.333333333333	333.333333333333	333.333333333333	333.333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.0333333333333333	0.342465753424658	10.8347059433884	)												
(	0.966666666666667	0.657534246575342	18.4591996354128	)												
	)															
	28.0733661121903	28.0733661121903														
	(															
(	0.0333333333333333	0.342465753424658	10.8347059433884	)												
(	0.966666666666667	0.657534246575342	18.4591996354128	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	298	73	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.003															
	(															
(	0.4	0.932885906040268	2	)												
(	0.6	0.0671140939597316	1.5	)												
	)															
	(															
(	0.4	0.932885906040268	2	)												
(	0.6	0.0671140939597316	1.5	)												
	)															
	0.003															
	//	y-direction	expansion	ratio												
	(															
(	0.966666666666667	0.657534246575342	0.054173529716942	)												
(	0.0333333333333333	0.342465753424658	0.092295998177064	)												
	)															
	(															
(	0.966666666666667	0.657534246575342	0.054173529716942	)												
(	0.0333333333333333	0.342465753424658	0.092295998177064	)												
	)															
	(															
(	0.966666666666667	0.657534246575342	0.054173529716942	)												
(	0.0333333333333333	0.342465753424658	0.092295998177064	)												
	)															
	(															
(	0.966666666666667	0.657534246575342	0.054173529716942	)												
(	0.0333333333333333	0.342465753424658	0.092295998177064	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	119	73	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	333.333333333333	333.333333333333	333.333333333333	333.333333333333												
	//	y-direction	expansion	ratio												
	(															
(	0.966666666666667	0.657534246575342	0.054173529716942	)												
(	0.0333333333333333	0.342465753424658	0.092295998177064	)												
	)															
	0.0356209510467564	0.0356209510467564														
	(															
(	0.966666666666667	0.657534246575342	0.054173529716942	)												
(	0.0333333333333333	0.342465753424658	0.092295998177064	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-9.60660171779821	10.6066017177982	0	)									
	arc	7 6 	(	-9.60660171779821	10.6066017177982	0.01	)									
																
	spline	1	0													
	(															
	(	0.99664	0.000985	0	)											
	(	0.987056	0.004265	0	)											
	(	0.972314	0.009834	0	)											
	(	0.953332	0.017037	0	)											
	(	0.930531	0.024949	0	)											
	(	0.903794	0.032768	0	)											
	(	0.872736	0.040403	0	)											
	(	0.837646	0.0481	0	)											
	(	0.799007	0.055842	0	)											
	(	0.75733	0.063544	0	)											
	(	0.71316	0.071084	0	)											
	(	0.667064	0.078312	0	)											
	(	0.619624	0.085056	0	)											
	(	0.571426	0.091118	0	)											
	(	0.523051	0.096277	0	)											
	(	0.475063	0.10028	0	)											
	(	0.428007	0.102811	0	)											
	(	0.382245	0.103258	0	)											
	(	0.337323	0.101581	0	)											
	(	0.293568	0.0983	0	)											
	(	0.251455	0.093644	0	)											
	(	0.211424	0.087785	0	)											
	(	0.173909	0.080881	0	)											
	(	0.139301	0.073078	0	)											
	(	0.107962	0.064532	0	)											
	(	0.08022	0.055386	0	)											
	(	0.056312	0.04581	0	)											
	(	0.036491	0.035989	0	)											
	(	0.020843	0.026134	0	)											
	(	0.009548	0.016553	0	)											
	(	0.002548	0.007584	0	)											
	(	0.000169	0.001654	0	)											
	(	0.000001	0.000102	0	)											
	(	0	0.000006	0	)											
	(	0.000198	-0.001417	0	)											
	(	0.000946	-0.002691	0	)											
	(	0.002165	-0.003992	0	)											
	(	0.003667	-0.005223	0	)											
	(	0.013639	-0.010342	0	)											
	(	0.029183	-0.015169	0	)											
	(	0.049938	-0.019578	0	)											
	(	0.075768	-0.023565	0	)											
	(	0.106324	-0.027219	0	)											
	(	0.141288	-0.03072	0	)											
	(	0.179884	-0.034729	0	)											
	(	0.220074	-0.038653	0	)											
	(	0.261526	-0.040769	0	)											
	(	0.304974	-0.040625	0	)											
	(	0.350096	-0.038079	0	)											
	)															
																
																
	spline	5	4													
	(															
	(	0.99664	0.000985	0.01	)											
	(	0.987056	0.004265	0.01	)											
	(	0.972314	0.009834	0.01	)											
	(	0.953332	0.017037	0.01	)											
	(	0.930531	0.024949	0.01	)											
	(	0.903794	0.032768	0.01	)											
	(	0.872736	0.040403	0.01	)											
	(	0.837646	0.0481	0.01	)											
	(	0.799007	0.055842	0.01	)											
	(	0.75733	0.063544	0.01	)											
	(	0.71316	0.071084	0.01	)											
	(	0.667064	0.078312	0.01	)											
	(	0.619624	0.085056	0.01	)											
	(	0.571426	0.091118	0.01	)											
	(	0.523051	0.096277	0.01	)											
	(	0.475063	0.10028	0.01	)											
	(	0.428007	0.102811	0.01	)											
	(	0.382245	0.103258	0.01	)											
	(	0.337323	0.101581	0.01	)											
	(	0.293568	0.0983	0.01	)											
	(	0.251455	0.093644	0.01	)											
	(	0.211424	0.087785	0.01	)											
	(	0.173909	0.080881	0.01	)											
	(	0.139301	0.073078	0.01	)											
	(	0.107962	0.064532	0.01	)											
	(	0.08022	0.055386	0.01	)											
	(	0.056312	0.04581	0.01	)											
	(	0.036491	0.035989	0.01	)											
	(	0.020843	0.026134	0.01	)											
	(	0.009548	0.016553	0.01	)											
	(	0.002548	0.007584	0.01	)											
	(	0.000169	0.001654	0.01	)											
	(	0.000001	0.000102	0.01	)											
	(	0	0.000006	0.01	)											
	(	0.000198	-0.001417	0.01	)											
	(	0.000946	-0.002691	0.01	)											
	(	0.002165	-0.003992	0.01	)											
	(	0.003667	-0.005223	0.01	)											
	(	0.013639	-0.010342	0.01	)											
	(	0.029183	-0.015169	0.01	)											
	(	0.049938	-0.019578	0.01	)											
	(	0.075768	-0.023565	0.01	)											
	(	0.106324	-0.027219	0.01	)											
	(	0.141288	-0.03072	0.01	)											
	(	0.179884	-0.034729	0.01	)											
	(	0.220074	-0.038653	0.01	)											
	(	0.261526	-0.040769	0.01	)											
	(	0.304974	-0.040625	0.01	)											
	(	0.350096	-0.038079	0.01	)											
	)															
																
																
	arc	3 12	(	-9.60660171779821	-10.6066017177982	0	)									
	arc	7 13	(	-9.60660171779821	-10.6066017177982	0.01	)									
																
	spline	0	16													
	(															
	(	0.447637	-0.025646	0	)											
	(	0.500087	-0.017114	0	)											
	(	0.554624	-0.008267	0	)											
	(	0.610364	0.000049	0	)											
	(	0.666289	0.007219	0	)											
	(	0.721305	0.012793	0	)											
	(	0.774276	0.016474	0	)											
	(	0.82406	0.018113	0	)											
	(	0.869551	0.017689	0	)											
	(	0.909558	0.015218	0	)											
	(	0.9427	0.011278	0	)											
	(	0.968241	0.006966	0	)											
	(	0.986101	0.003275	0	)											
	(	0.996568	0.00085	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	(	0	0	0	)											
	)															
																
																
	spline	4	17													
	(															
	(	0.447637	-0.025646	0.01	)											
	(	0.500087	-0.017114	0.01	)											
	(	0.554624	-0.008267	0.01	)											
	(	0.610364	0.000049	0.01	)											
	(	0.666289	0.007219	0.01	)											
	(	0.721305	0.012793	0.01	)											
	(	0.774276	0.016474	0.01	)											
	(	0.82406	0.018113	0.01	)											
	(	0.869551	0.017689	0.01	)											
	(	0.909558	0.015218	0.01	)											
	(	0.9427	0.011278	0.01	)											
	(	0.968241	0.006966	0.01	)											
	(	0.986101	0.003275	0.01	)											
	(	0.996568	0.00085	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	(	0	0	0.01	)											
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
																
boundary																
(																
inlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (9 2 6 11)  // block face in this patch																
                (2 3 7 6  )  // block face in this patch																
                (3 12 13 7  )  // block face in this patch																
                (12 15 14 13  )  // block face in this patch																
            );																
        } 																
																
outlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (8 9 10 11)  // block face in this patch																
                (15 8 10 14  )  // block face in this patch																
            );																
        }																
																
walls              // patch name																
        {																
            type wall;    // patch type for patch 0																
            faces																
            (																
                (0 1 5 4)  // block face in this patch																
                (0 4 17 16  )  // block face in this patch																
            );																
        } 																
																
interface1              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (1 8 10 5)  // block face in this patch																
            );																
        } 																
interface2              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (16 17 10 8)  // block face in this patch																
            );																
        } 																
);																
																
 mergePatchPairs																
(																
    ( interface1 interface2 ) 																
);																
// ************************************************************************* //																
