GRTsteady4Mesh2/constant/physicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class dictionary;
 location "constant";
 object physicalProperties;
}

viscosityModel constant;

nu nu     [ 0 2 -1 0 0 0 0 ]     1.1516e-05 ; 	// ************************************************************************* //

