GRTsteady4Mesh2/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (1 1 0);

boundaryField
{
  inlet
  {
        type            freestreamVelocity;
        freestreamValue $internalField;
  }
  outlet
  {
        type            freestreamVelocity;
        freestreamValue $internalField;
  }
  sides
  {
    type empty;
  }
  airfoil
  {
    type noSlip;
  }
} 	// ************************************************************************* //

