GRTsteady4Mesh2/0/ReThetat
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volScalarField;
 location "0";
 object ReThetat;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 619.6962087460389; 	//

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField; 	//inlet
  }
  "(airfoil|outlet)"
  {
    type zeroGradient;
  }
  sides
  {
    type empty;
  }
} 	// ************************************************************************* //

