GRTsteady4Mesh2/0/gammaInt
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volScalarField;
 location "0";
 object gammaInt;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 1;

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField; 	//inlet
  }
  "airfoil|outlet"
  {
    type zeroGradient;
  }
  sides
  {
    type empty;
  }
} 	// ************************************************************************* //

