GRTsteady4Mesh2/0/k
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volScalarField;
 location "0";
 object k;
}

dimensions [ 0 2 -2 0 0 0 0 ];

kbound 0.00017577223650239992;

internalField uniform $kbound;

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField; 	//inlet
  }
  outlet
  {
    type zeroGradient;
  } 	//outlet
  airfoil
  {
    type fixedValue;
    value uniform 0;
  }
  sides
  {
    type empty;
  }
} 	// ************************************************************************* //

