GRTsteady4Mesh2/0/nut
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volScalarField;
 location "0";
 object nut;
}

dimensions [ 0 2 -1 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  "(inlet|outlet)"
  {
    type calculated;
    value $internalField; 	//outlet
  }
  sides
  {
    type empty;
  }
  "airfoil"
  {
    type nutkWallFunction;
    value $internalField;
  }
} 	// ************************************************************************* //

