GRTsteady4Mesh2/0/omega
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 format ascii;
 class volScalarField;
 location "0";
 object omega;
}

dimensions [ 0 0 -1 0 0 0 0 ];

omega_bound 180.10701551999995;

internalField uniform $omega_bound;

boundaryField
{
  inlet
  {
    type fixedValue;
    value $internalField; 	//inlet
  }
  outlet
  {
    type inletOutlet;
    inletValue $internalField; 	//outlet
    value $internalField;
  }
  sides
  {
    type empty;
  }
  airfoil
  {
    type omegaWallFunction;
    value $internalField;
  }
} 	// ************************************************************************* //

