GRTsteady4Mesh2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver              GAMG;
        smoother            GaussSeidel;
        //preconditioner  DIC;
        tolerance           1e-7;
        relTol              0.01;
        nPreSweeps          0; 
        nPostSweeps         5;
        minIter             5;
    }

    Phi
    {
        $p;
    }
    
    U
    {
        type coupled;
        solver PBiCCCG;
        preconditioner DILU;
        tolerance (1e-08 1e-08 1e-08);
        relTol (0 0 0);
        minIter 3;
    }

    "(k|omega|gammaInt|ReThetat)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    
    consistent yes;

    residualControl
    {
        p               1e-7;
        U               1e-8;
        "(k|omega|gammaInt|ReThetat)" 1e-7;
    }
}

relaxationFactors
{

    equations
    {
        
        U               0.7;
        k               0.01;            //low value 0.01
        omega           0.01;            //low value 0.01
        ReThetat        0.7; 
        gammaInt        0.7;
        
        //".*"            0.5;
    }

}

// ************************************************************************* //
