GRTsteady4Mesh2/system/sampleObjectPatch
type            surfaceFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime; 
writeFields     true;

surfaceFormat   raw; 
regionType      patch; 

name            Object; 

operation       none; 

fields
(
    p
);
